-- 1. Виды животных
INSERT INTO species_dict (code, name_ru) VALUES
('cat',     'Кошка'),
('dog',     'Собака'),
('hamster', 'Хомяк');

-- 2. Породы 
INSERT INTO breeds_dict (species_id, name, predisposition_notes) VALUES
-- Кошки
(1, 'Беспородная', 'Нет специфических предрасположенностей'),
(1, 'Британская шиншилла', 'Предрасположенность к ожирению и проблемам с зубами'),
(1, 'Шотландская вислоухая', 'Высокий риск остеохондродистрофии (СКД)'),
-- Собаки
(2, 'Корги', 'Риск проблем с позвоночником, склонность к полноте'),
(2, 'Английский кокер-спаниель', 'Хронические отиты из-за строения ушей'),
-- Хомяки
(3, 'Сирийский', 'Не переносят совместного содержания, чувствительны к наполнителю');
